guanfrank/dogsoul/STM32_DIsco/patu/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "stm32f4xx_hal_tim.h"
#include "stm32f4xx_hal_spi.h"
#include "stm32f4_discovery.h"
#include "pv_picovoice.h"
#include "pv_audio_rec.h"
#include "pv_params.h"
#include "pv_st_f407.h"

#include "LIS3DSH.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


#define MEMORY_BUFFER_SIZE (70 * 1024)

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

DSI_HandleTypeDef hdsi;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

SAI_HandleTypeDef hsai_BlockA1;

SD_HandleTypeDef hsd;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim7;


UART_HandleTypeDef huart3;
UART_HandleTypeDef huart6;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;

/* USER CODE BEGIN PV */

TIM_HandleTypeDef TimHandle;

uint32_t uwPrescalerValue = 0;
uint8_t WALK=0, STAND=0;
float accel_x, accel_y, accel_z;
float pitch, roll;
int8_t READ_ACC = 0;

#ifdef PICOVOICE
static int8_t memory_buffer[MEMORY_BUFFER_SIZE] __attribute__((aligned(16)));
static const float PORCUPINE_SENSITIVITY = 0.75f;
static const float RHINO_SENSITIVITY = 0.5f;
static const float RHINO_ENDPOINT_DURATION_SEC = 1.0f;
static const bool RHINO_REQUIRE_ENDPOINT = true;
static const char* ACCESS_KEY = "fKXqfXSOn2RG3z0SQmfIBe5Oe9eU9B0EtDhxNhaNNUrdCPVERLIkAQ=="; //AccessKey string obtained from Picovoice Console (https://picovoice.ai/console/)
#endif

/* UART handler declaration */
UART_HandleTypeDef UartHandle;
extern void uartTx();
//__IO ITStatus UartReady = RESET;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_DSIHOST_DSI_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_SAI1_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM7_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */
void accConfigInit(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 4 */
int balance(int ind) {
	//sprintf((char*)buf, "#AccXYZ:%5.2f,%5.2f,%5.2f\r\n", acc.x, acc.y, acc.z);
	//HAL_StatusTypeDef ret;
	if(ind < 0 || ind >3) return -1;
	if(ind == 0) {//move front
		printf("F\n");
		uartTx(3);
//		ret = HAL_UART_Transmit(&huart3, "F", 1, HAL_MAX_DELAY);
//		if(ret != HAL_OK) 	printf("Error Tx:%d\r\n", ret);
	}else if(ind == 1) {//move back
		printf("B\n");
		uartTx(4);
//		ret = HAL_UART_Transmit(&huart3, "B", 1, HAL_MAX_DELAY);
//		if(ret != HAL_OK) {
//		   printf("Error Tx:%d\r\n", ret);}
	}else if(ind == 2) {//stop
		printf("A\n");
		uartTx(2);
//		ret = HAL_UART_Transmit(&huart3, "A", 1, HAL_MAX_DELAY);
//		if(ret != HAL_OK) {
//		   printf("Error Tx:%d\r\n", ret);}
	}
#ifdef SHOW_LEDs
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, LEDS[ind][0]);//red
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, LEDS[ind][1]);//green
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, LEDS[ind][2]);//blue
#endif
	return 0;
}

void accConfigInit(void){
	LIS3DSH_InitTypeDef accConfigDef;
	accConfigDef.dataRate = LIS3DSH_DATARATE_3_125; /* 3.125 Hz Normal Mode */
	accConfigDef.fullScale = LIS3DSH_FULLSCALE_2;   /* was 16 g  */
	accConfigDef.enableAxes = LIS3DSH_XYZ_ENABLE;
	accConfigDef.antiAliasingBW = LIS3DSH_FILTER_BW_50;  /* 50 Hz  */
	accConfigDef.interruptEnable = false;
	LIS3DSH_Init(&hspi1, &accConfigDef);
}

extern void uartTx(int32_t indx);

extern void complementaryFilter( );
void readACC(void)
{
	/* USER CODE BEGIN 1 */
	//const uint8_t UART_BUF_MAX = 80;
	//uint8_t buf[UART_BUF_MAX];
	//HAL_StatusTypeDef ret;
	//LIS3DSH_InitTypeDef accConfigDef;
	LIS3DSH_DataScaled acc;
	/* USER CODE END 1 */
	/* USER CODE BEGIN 3 */
	if(LIS3DSH_PollDRDY(1000))
	{
		acc = LIS3DSH_GetDataScaled();
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
		accel_x = acc.x;
		accel_y = acc.y;
		accel_z = acc.z;
	    // Run the complementary filter
	    complementaryFilter( );
	   	if( pitch > 0.1f) {//move up/back - red
			balance(0);
		}else if(pitch < -0.1f) {//move down/front - green
			balance(1);
		}else {//no move - blue
			balance(2);
		}
		//sprintf((char*)buf,"#AccXYZ:%.12f,%.12f,%.12f\r\n", acc.x, acc.y, acc.z);
		//printf("#XYZ:%.12f,%.12f,%.12f\r\n", acc.x, acc.y, acc.z);
		//printf("#AccXYZ:%5.2f,%5.2f,%5.2f\r\n", acc.x, acc.y, acc.z);
	}
}
#ifdef PICOVOICE
static void wake_word_callback(void) {
	printf("[wake word]\n");
	BSP_LED_On(LED4);

