guanfrank/dogsoul/STM32_DIsco/patu/Core/Src/main.c
}
static void inference_callback(pv_inference_t *inference) {
	BSP_LED_Off(LED4);
	printf("{\n");
	printf("    is_understood : '%s',\n", (inference->is_understood ? "true" : "false"));
	if (inference->is_understood) {
		printf("    intent : '%s',\n", inference->intent);
		if (inference->num_slots > 0) {
			printf("    slots : {\n");
			for (int32_t i = 0; i < inference->num_slots; i++) {
				printf("        '%s' : '%s',\n", inference->slots[i], inference->values[i]);
				if(strcmp(inference->values[i], "penthouse")==0){
					//uartTx(inference->num_slots);
					WALK = 1;
					STAND =0;
				}else if (strcmp(inference->values[i], "p one") == 0){
					//Xmit after pv_inference_delete
					STAND = 1;
					WALK = 0;
				}
			}
			printf("    }\n");
		}
	}
	printf("}\n\n");
	for (int32_t i = 0; i < 10; i++) {
		BSP_LED_Toggle(LED3);
		BSP_LED_Toggle(LED4);
		BSP_LED_Toggle(LED5);
		BSP_LED_Toggle(LED6);
		HAL_Delay(30);
	}
	pv_inference_delete(inference);
	if (WALK)
		uartTx(0);
	else if (STAND)
		uartTx(1);
}
/* USER CODE END 4 */
#endif
/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* Configure the peripherals common clocks */
	PeriphCommonClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_CRC_Init();
	MX_DMA2D_Init();
	MX_DSIHOST_DSI_Init();
	MX_FMC_Init();
	MX_I2C1_Init();
	MX_I2C2_Init();
	MX_LTDC_Init();
	MX_QUADSPI_Init();
	MX_SAI1_Init();
	MX_SDIO_SD_Init();
	MX_TIM1_Init();
	MX_USART3_UART_Init();
	MX_USART6_UART_Init();
	MX_FATFS_Init();
	MX_SPI1_Init();
	MX_TIM7_Init();
	/* USER CODE BEGIN 2 */
	/* Configure LED3, LED4, LED5 and LED6 */
	BSP_LED_Init(LED3);
	BSP_LED_Init(LED4);
	BSP_LED_Init(LED5);
	BSP_LED_Init(LED6);

	/* USER CODE END 2 */

	/* USER CODE BEGIN 3 */
	accConfigInit();
	/* USER CODE BEGIN 3 */

	/* USER CODE BEGIN RTOS_MUTEX */
	/* add mutexes, ... */
	/* USER CODE END RTOS_MUTEX */

	/* USER CODE BEGIN RTOS_SEMAPHORES */
	/* add semaphores, ... */
	/* USER CODE END RTOS_SEMAPHORES */

	/* USER CODE BEGIN RTOS_TIMERS */
	/* start timers, add new ones, ... */
	/* USER CODE END RTOS_TIMERS */

	/* USER CODE BEGIN RTOS_QUEUES */
	/* add queues, ... */
	/* USER CODE END RTOS_QUEUES */

	/* USER CODE BEGIN SCHEDULER */
	/* Create the thread(s) */
	/* definition and creation of defaultTask */
	//osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 4096);
	//defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);
	/* USER CODE END SCHEDULER */

	/* USER CODE BEGIN RTOS_THREADS */
	/* add threads, ... */
	/* USER CODE END RTOS_THREADS */

	/* USER CODE BEGIN RTOS_SCHEDULER */
	/* Start scheduler */
#ifdef USE_SCHEDULER
	osKernelStart();
#endif
	/* USER CODE END RTOS_SCHEDULER */

	/* USER CODE BEGIN 5 */
#ifdef PICOVOICE
	pv_status_t status = pv_board_init();
	if (status != PV_STATUS_SUCCESS) {
		Error_Handler();
	}
	const uint8_t *board_uuid = pv_get_uuid();
	printf("UUID: ");
	for (uint32_t i = 0; i < pv_get_uuid_size(); i++) {
		printf(" %.2x", board_uuid[i]);
	}
	printf("\r\n");
	status = pv_audio_rec_init();
	if (status != PV_STATUS_SUCCESS) {
		printf("Audio init failed with '%s'", pv_status_to_string(status));
		Error_Handler();
	}
	status = pv_audio_rec_start();
	if (status != PV_STATUS_SUCCESS) {
		printf("Recording audio failed with '%s'", pv_status_to_string(status));
		Error_Handler();
	}
	pv_picovoice_t *handle = NULL;
	status = pv_picovoice_init(
			ACCESS_KEY,
			MEMORY_BUFFER_SIZE,
			memory_buffer,
			sizeof(KEYWORD_ARRAY),
			KEYWORD_ARRAY,
			PORCUPINE_SENSITIVITY,
			wake_word_callback,
			sizeof(CONTEXT_ARRAY),
			CONTEXT_ARRAY,
			RHINO_SENSITIVITY,
			RHINO_ENDPOINT_DURATION_SEC,
			RHINO_REQUIRE_ENDPOINT,
			inference_callback,
			&handle);
	if (status != PV_STATUS_SUCCESS) {
		printf("Picovoice init failed with '%s'", pv_status_to_string(status));
		Error_Handler();
	}

	const char *rhino_context = NULL;
	status = pv_picovoice_context_info(handle, &rhino_context);
	if (status != PV_STATUS_SUCCESS) {
		printf("retrieving context info failed with '%s'", pv_status_to_string(status));
		Error_Handler();
	}
	printf("Rhino context info: %s\r\n", rhino_context);
	printf("hello hello hello");
	/* USER CODE BEGIN 3 */
	/*##-2- Start the TIM Base generation in interrupt mode ####################*/
	/* Start Channel1 */
#endif
	/* USER CODE END 5 */
	/* Start Channel1 */
	if(HAL_TIM_Base_Start_IT(&TimHandle) != HAL_OK)
	{
		/* Starting Error */
		Error_Handler();
	}

	/* USER CODE BEGIN 6 */
#ifdef PICOVOICE
	while (true) {
		const int16_t *buffer = pv_audio_rec_get_new_buffer();
		if (buffer) {
			const pv_status_t status = pv_picovoice_process(handle, buffer);
			if (status != PV_STATUS_SUCCESS) {
				printf("Picovoice process failed with '%s'", pv_status_to_string(status));
				Error_Handler();
			}
		}
#ifndef READacc
		if (READ_ACC ) {
			readACC();
			READ_ACC = 0; // reset to false
		}
#endif
	}
	pv_board_deinit();
	pv_audio_rec_deinit();
	pv_picovoice_delete(handle);
#endif
	/* USER CODE END 6 */

	/* We should never get here as control is now taken by the scheduler */
	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
#ifndef READacc
		if (READ_ACC ) {
			readACC();
			READ_ACC = 0; // reset to false
		}
#endif
	}
	/* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 180;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 6;
  RCC_OscInitStruct.PLL.PLLR = 6;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Activate the Over-Drive mode
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief Peripherals Common Clock Configuration
  * @retval None
  */
void PeriphCommonClock_Config(void)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Initializes the peripherals clock
  */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI_PLLSAI|RCC_PERIPHCLK_SDIO
                              |RCC_PERIPHCLK_CLK48|RCC_PERIPHCLK_LTDC;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 144;
  PeriphClkInitStruct.PLLSAI.PLLSAIR = 2;
  PeriphClkInitStruct.PLLSAI.PLLSAIQ = 2;
  PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV6;
  PeriphClkInitStruct.PLLSAIDivQ = 1;
  PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_4;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48CLKSOURCE_PLLSAIP;
  PeriphClkInitStruct.SdioClockSelection = RCC_SDIOCLKSOURCE_CLK48;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief CRC Initialization Function
  * @param None
  * @retval None
  */
static void MX_CRC_Init(void)
{

  /* USER CODE BEGIN CRC_Init 0 */

  /* USER CODE END CRC_Init 0 */

